content/brief/_index.md
+++
title = "Brief"
author = ["Ben Ford"]
lastmod = 2019-02-07T19:14:54+00:00
draft = false
+++

## General info {#general-info}

This year I am launching a new business that leverages my unique background as
both a Royal Marine and someone operating at a high level of technical skill as
a developer, technologist and leader. For several years I've been an IT contractor. Over
the course of this year, I want to transition into doing more leveraged training
and coaching work.

The way I envisage this working - which has not yet been tested by first contact
with the enemy :-) is that I will sell a mixture of premium digital products and
high ticket consulting with clients. The digital products will start with a
course on instilling operational excellence within a development team. It will
be aimed at either the business owner or the technical team lead. Further
courses may well follow such as:

-   Becoming a better developer
-   How to work within a team
-   How to structure training

The coaching side of the business is envisaged as a leveraged delivery model (so
many clients at once) offering an operational transformation over approximately
a 90 day period. It will more than likely be based on the structure of the
initial course that I plan to start selling in the next month or so. So: 6 ish
sections (TBC) each with a theory and practice element to them. Delivery will
hopefully be remote with the theory and practice being delivered at the
beginning of the week and some form of implementation and follow up offered
before the next module in about 2 weeks time.
